Австралия/src/Catalogs/DefaultIncomeAndExpenseItems/DefaultIncomeAndExpenseItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultIncomeAndExpenseItems</name>
  <predefined>
    <items>
      <name>Expenses</name>
      <description>Administrative expenses</description>
    </items>
    <items>
      <name>BankFees</name>
      <description>Bank fees (expense account)</description>
    </items>
    <items>
      <name>COGS</name>
      <description>COGS</description>
    </items>
    <items>
      <name>LoanCommissionExpenses</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>LoanCommissionIncome</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>DepreciationCharge</name>
      <description>Depreciation charge</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>FXIncome</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>FXExpenses</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>InterestExpenses</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>ManufacturingOverheads</name>
      <description>Manufacturing overheads</description>
    </items>
    <items>
      <name>OtherExpenses</name>
      <description>Other expenses</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollIncome</name>
      <description>Payroll income</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>PurchaseReturn</name>
      <description>Purchase return</description>
    </items>
    <items>
      <name>Revenue</name>
      <description>Revenue</description>
    </items>
    <items>
      <name>SalesReturn</name>
      <description>Sales return</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Write-off over/under allocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/DefaultIncomeAndExpenseItems/Forms/ListForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Parameters.Property("FromMapping", FromMapping);
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject);
	
EndProcedure

&AtClient
Procedure ListOnChange(Item)
	
	If Item.CurrentData <> Undefined And FromMapping
				And Item.CurrentData.Ref = PredefinedValue("Catalog.DefaultIncomeAndExpenseItems.OtherExpenses") Then
		OtherExpenses = Item.CurrentData.IncomeAndExpenseItem;
	EndIf;
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, Exit, MessageText, StandardProcessing)
	
	If Not Exit And FromMapping Then
		StandardProcessing = False;
		Close(New Structure("OtherExpenses", OtherExpenses));
	EndIf;
	
EndProcedure

#EndRegion
